src/main/test/artillery/user/get_csv_users.yaml
config:
  target: http://127.0.0.1:8080/tukano/rest
  phases:
    - name: simple_get
      duration: 25 # How long the test will run for, in seconds
      arrivalRate: 1 # Number of arrivals per second
  payload:
    path: ../data/random_users.csv
    order: sequence # selects users sequentially, default is random
    #loadAll: true # load the whole CSV
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: TuKanoHome
    flow:
      - post: # This is for the login request
          url: /users/login
          headers:
            Content-Type: application/x-www-form-urlencoded # Explicitly set the content type
          body: "userId={{ userId }}&pwd={{ pwd }}" # Manually constructing the body
          capture:
            cookies: cookies # Capture cookies to store them
            as: cookies

      - get: # This is to fetch user data after login
          url: /users/{{ userId }} # Ensure the URL is correct
          headers:
            Cookie: "{{ cookies }}" # Use captured cookies here