src/main/test/artillery/user/update_csv_users.yaml
config:
  target: http://127.0.0.1:8080/tukano/rest
  plugins:
    expect: { }
    metrics-by-endpoint: { }
  phases:
    - name: simple_get
      duration: 25
      arrivalRate: 1
  payload:
    path: ../data/random_users.csv
    order: sequence
    skipHeader: true
    delimiter: ","
    skipEmptyLines: true
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: TuKanoHome
    flow:
      - post:
          url: /users/login
          expect:
            - statusCode: 200
          headers:
            Content-Type: application/x-www-form-urlencoded
          body: "userId={{ userId }}&pwd={{ pwd }}"
      - log: "Login successful, proceeding to update user data."
      - put:
          url: /users/{{ userId }}
          expect:
            - statusCode: 200
          headers:
            Content-Type: application/json
          json:
            id: "{{ userId }}"
            pwd: "{{ pwd }}"
            email: "updated_{{ email }}"
            displayName: "{{ displayName }}_updated"